package Task5;

public class Main {
    public static void main(String[] args) {
    //Создаем мини приложение - интернет-магазин.  Должны быть реализованы следующие возможности:
        //а) аутентификация пользователя (пользователь вводит логин и пароль с клавиатуры),
        //б) просмотр списка каталогов товаров,
        //в) просмотр списка всех товаров определенного каталога,
        //г) выбор товара в корзину,
        //д) покупка товаров, находящихся в корзине.
        //Создаем перечисление содержащее значения для перечисленных операций.
        // Можете добавить свои операции или изменить что-то на свой вкус.

    }
    }
